NoMaY-jp/FreeRTOS_examples_for_Renesas_R_CPUs/13_RTOSDemo/RX600_RX65N_TB_IAR_e2studio_EWRX/src/FreeRTOS_Demo/demo_specific_io.h
/*
 * FreeRTOS V202012.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

#ifndef LED_IO_H
#define LED_IO_H

/* Select one of the following defines. Note that you don't have to
change the target device. */

	#if !defined(RSK_RX65N) && !defined(RPB_RX65N) && !defined(TB_RX65N)

		//#define RSK_RX65N		/* Renesas Starter Kit+ for RX65N-2MB */
		//#define RPB_RX65N		/* Renesas Envision KIT RPBRX65N */
		#define TB_RX65N		/* Target Board for RX65N */

	#endif

/* But, in case of GNURX project, if you change the target device,
please take care of the following three KEEP() statements in the
src/linker_script.ld file by your hand. */

/*
	.text 0xFFE00000: AT(0xFFE00000)
	{
		*(.text)
		KEEP(*(.text.*ISR))
		KEEP(*(.text.*_isr))
		KEEP(*(.text.*_interrupt))
		*(.text.*)
		*(P)
		etext = .;
	} > ROM
*/

/* Board support settings. */

	#ifdef RSK_RX65N

		/* https://www.renesas.com/jp/ja/products/software-tools/boards-and-kits/starter-kits/renesas-starter-kitplus-for-rx65n-2mb.html */

		/* R5F565NEDDFC (or R5F565NEHDFC) 176-pin LFQFP */

		/* General Values */
		#define LED_ON					(0)
		#define LED_OFF 				(1)
		#define SET_BIT_HIGH			(1)
		#define SET_BIT_LOW 			(0)

		/* Switches */
		#define SW1 					(PORT0.PIDR.BIT.B3)
		#define SW2 					(PORT0.PIDR.BIT.B5)
		#define SW3 					(PORT0.PIDR.BIT.B7)
		#define U_GPIO_PIN_SW1			(GPIO_PORT_0_PIN_3)
		#define U_GPIO_PIN_SW2			(GPIO_PORT_0_PIN_5)
		#define U_GPIO_PIN_SW3			(GPIO_PORT_0_PIN_7)

		/* LED port settings */
		#define LED0					(PORT7.PODR.BIT.B3)
		#define LED1					(PORTG.PODR.BIT.B7)
		#define LED2					(PORTG.PODR.BIT.B6)
		#define LED3					(PORTG.PODR.BIT.B5)
		#define U_GPIO_PIN_LED0 		(GPIO_PORT_7_PIN_3)
		#define U_GPIO_PIN_LED1 		(GPIO_PORT_G_PIN_7)
		#define U_GPIO_PIN_LED2 		(GPIO_PORT_G_PIN_6)
		#define U_GPIO_PIN_LED3 		(GPIO_PORT_G_PIN_5)

		/* FreeRTOS CLI Command Console */
		extern void U_SCI_PinSet_SCI8_RSK_RX65N(void);
		#define U_SCI_UART_CLI_PINSET()	U_SCI_PinSet_SCI8_RSK_RX65N()
		#define U_SCI_UART_CLI_SCI_CH	(SCI_CH8)
		#define U_DTC_UART_CLI_TX_ACT	((dtc_activation_source_t)VECT(SCI8,TXI8))
		#define U_DTC_UART_CLI_TX_DR	(SCI8.TDR)

	#endif /* RSK_RX65N */

	#ifdef RPB_RX65N

		/* https://www.renesas.com/us/ja/products/software-tools/boards-and-kits/eval-kits/rx65n-envision-kit.html */

		/* R5F565NEDDFB 144-pin LFQFP */

		/* General Values */
		#define LED_ON					(0)
		#define LED_OFF 				(1)
		#define SW_PUSH 				(0)
		#define SW_RELEASE				(1)

		/* Switches (and its notation in the User's Manual) */
		#define SW1/*(SW2)*/				(PORT0.PIDR.BIT.B5)
		#define U_GPIO_PIN_SW1/*(SW2)*/ 	(GPIO_PORT_0_PIN_5)

		/* LED port settings (and its notation in the User's Manual) */
		#define LED0/*(LED2)*/				(PORT7.PODR.BIT.B0)
		#define U_GPIO_PIN_LED0/*(LED2)*/	(GPIO_PORT_7_PIN_0)

		/* FreeRTOS CLI Command Console */
		#define U_SCI_UART_CLI_PINSET()	R_SCI_PinSet_SCI5()
		#define U_SCI_UART_CLI_SCI_CH	(SCI_CH5)
		#define U_DTC_UART_CLI_TX_ACT	((dtc_activation_source_t)VECT(SCI5,TXI5))
		#define U_DTC_UART_CLI_TX_DR	(SCI5.TDR)

	#endif /* RPB_RX65N */

	#ifdef TB_RX65N

		/* https://www.renesas.com/products/software-tools/boards-and-kits/eval-kits/rx-family-target-board.html */

		/* R5F565NEDDFP	100-pin LFQFP */

		/* General Values */
		#define LED_ON					(0)
		#define LED_OFF 				(1)
		#define SW_PUSH 				(0)
		#define SW_RELEASE				(1)

		/* Switches */
		#define SW1						(PORTB.PIDR.BIT.B1)
		#define U_GPIO_PIN_SW1			(GPIO_PORT_B_PIN_1)

		/* LED port settings  */
		#define LED0					(PORTD.PODR.BIT.B6)
		#define LED1					(PORTD.PODR.BIT.B7)
		#define U_GPIO_PIN_LED0			(GPIO_PORT_D_PIN_6)
		#define U_GPIO_PIN_LED1			(GPIO_PORT_D_PIN_7)

		/* FreeRTOS CLI Command Console */
		#define U_SCI_UART_CLI_PINSET()	R_SCI_PinSet_SCI1()
		#define U_SCI_UART_CLI_SCI_CH	(SCI_CH1)
		#define U_SCI_UART_CLI_RX_PU	(GPIO_PORT_3_PIN_0)
		#define U_DTC_UART_CLI_TX_ACT	((dtc_activation_source_t)VECT(SCI1,TXI1))
		#define U_DTC_UART_CLI_TX_DR	(SCI1.TDR)

	#endif /* TB_RX65N */

	#ifndef LED0
		#error The hardware platform is not defined
	#endif

#endif /* LED_IO_H */

#ifdef BSP_CFG_MCU_PART_PACKAGE

#ifndef LED_IO_H_EXT
#define LED_IO_H_EXT

/* Board Support Data Structures. */

#include "r_sci_rx_if.h"
#include "r_dtc_rx_if.h"

extern sci_hdl_t xSerialSciHandle;
extern dtc_transfer_data_t xSerialTxDtcInfo;

/* Board Support Callback Functions. */

extern void vSerialSciCallback( void *pvArgs );

#endif /* LED_IO_H_EXT */

#endif /* BSP_CFG_MCU_PART_PACKAGE */

